# Basic sqllite 3 library tutorial
 
# SQL & Pandas Interaction 

Outline : 

1. create DB engine 

2. read_sql 

3. to_sql 

4. pull and store financial in a sql db 

5. Potential topics

In [1]:
import sqlite3
import sqlalchemy 

import numpy as np 
import pandas as pd

In [2]:
engine = sqlalchemy.create_engine('sqlite:///ken_chiang.db')

# you can ethier condition in query or in python language

In [3]:
employess = pd.read_sql("SELECT * FROM employees WHERE salary > 10 ",engine)

employess[employess['salary']>100000]

      name surname    salary
2   Denzel    cook  200000.0
3  Maxwell  Foster  120000.0

In [4]:
df1 = pd.DataFrame({
    "name":'Maxwell',
    'surname':"Foster",
    "salary":[120000]
})

df1

      name surname  salary
0  Maxwell  Foster  120000

In [6]:
df1.to_sql('employees',engine,if_exists='append',index=False)

In [7]:
df1.to_sql('employees',engine,if_exists='replace',index=False)

In [9]:
import datetime as dt 
from pandas_datareader import data as pdr 


start = dt.datetime(2021,1,1)
now = dt.datetime.now()

df = pdr.get_data_yahoo('GME',start,now)
df

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2020-12-31,19.799999,18.799999,19.250000,18.840000,6922700,18.840000
2021-01-04,19.100000,17.150000,19.000000,17.250000,10022500,17.250000
2021-01-05,18.080000,17.230000,17.350000,17.370001,4961500,17.370001
2021-01-06,18.980000,17.330000,17.340000,18.360001,6056200,18.360001
2021-01-07,19.450001,18.020000,18.469999,18.080000,6129300,18.080000
...,...,...,...,...,...,...
2021-05-18,189.199997,168.270004,174.539993,180.669998,7738700,180.669998
2021-05-19,178.979996,164.149994,171.990005,168.830002,4825900,168.830002
2021-05-20,174.910004,166.899994,170.789993,170.490005,2478200,170.490005
2021-05-21,179.240005,170.330002,171.000000,176.789993,3648400,176.789993
2021-05-24,188.457596,173.350006,175.850006,180.009995,4633820,180.009995

In [10]:
df.to_sql('GME',engine)

In [11]:
pd.read_sql('GME',engine)

,Date,High,Low,Open,Close,Volume,Adj Close
0,2020-12-31,19.799999,18.799999,19.250000,18.840000,6922700,18.840000
1,2021-01-04,19.100000,17.150000,19.000000,17.250000,10022500,17.250000
2,2021-01-05,18.080000,17.230000,17.350000,17.370001,4961500,17.370001
3,2021-01-06,18.980000,17.330000,17.340000,18.360001,6056200,18.360001
4,2021-01-07,19.450001,18.020000,18.469999,18.080000,6129300,18.080000
...,...,...,...,...,...,...,...
94,2021-05-18,189.199997,168.270004,174.539993,180.669998,7738700,180.669998
95,2021-05-19,178.979996,164.149994,171.990005,168.830002,4825900,168.830002
96,2021-05-20,174.910004,166.899994,170.789993,170.490005,2478200,170.490005
97,2021-05-21,179.240005,170.330002,171.000000,176.789993,3648400,176.789993
98,2021-05-24,188.457596,173.350006,175.850006,180.009995,4633820,180.009995